OldTests/Win-wsl4core/benchmark_raw_20260510_125645/raw_logs/fio_mixed_70_30_raw.txt
mixed_70_30: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=8
fio-3.39
Starting 1 process
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1

mixed_70_30: (groupid=0, jobs=1): err= 0: pid=6683: Sun May 10 13:11:34 2026
  read: IOPS=3695, BW=14.4MiB/s (15.1MB/s)(866MiB/60001msec)
    clat (usec): min=96, max=41624, avg=226.20, stdev=169.06
     lat (usec): min=96, max=41624, avg=226.32, stdev=169.07
    clat percentiles (usec):
     |  1.00th=[  117],  5.00th=[  149], 10.00th=[  159], 20.00th=[  176],
     | 30.00th=[  215], 40.00th=[  219], 50.00th=[  223], 60.00th=[  229],
     | 70.00th=[  235], 80.00th=[  237], 90.00th=[  243], 95.00th=[  262],
     | 99.00th=[  627], 99.50th=[ 1401], 99.90th=[ 2180], 99.95th=[ 2278],
     | 99.99th=[ 3916]
   bw (  KiB/s): min= 9160, max=17064, per=100.00%, avg=14788.03, stdev=892.84, samples=119
   iops        : min= 2290, max= 4266, avg=3697.01, stdev=223.21, samples=119
  write: IOPS=1589, BW=6357KiB/s (6510kB/s)(373MiB/60001msec); 0 zone resets
    clat (usec): min=81, max=33850, avg=98.76, stdev=119.75
     lat (usec): min=81, max=33850, avg=98.95, stdev=119.75
    clat percentiles (usec):
     |  1.00th=[   87],  5.00th=[   89], 10.00th=[   90], 20.00th=[   92],
     | 30.00th=[   94], 40.00th=[   94], 50.00th=[   95], 60.00th=[   95],
     | 70.00th=[   96], 80.00th=[   98], 90.00th=[  113], 95.00th=[  129],
     | 99.00th=[  147], 99.50th=[  161], 99.90th=[  273], 99.95th=[  433],
     | 99.99th=[ 2966]
   bw (  KiB/s): min= 4136, max= 7248, per=100.00%, avg=6360.13, stdev=447.92, samples=119
   iops        : min= 1034, max= 1812, avg=1590.03, stdev=111.98, samples=119
  lat (usec)   : 100=25.87%, 250=68.70%, 500=4.52%, 750=0.35%, 1000=0.13%
  lat (msec)   : 2=0.31%, 4=0.11%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=1.44%, sys=7.21%, ctx=317123, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=221760,95364,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=14.4MiB/s (15.1MB/s), 14.4MiB/s-14.4MiB/s (15.1MB/s-15.1MB/s), io=866MiB (908MB), run=60001-60001msec
  WRITE: bw=6357KiB/s (6510kB/s), 6357KiB/s-6357KiB/s (6510kB/s-6510kB/s), io=373MiB (391MB), run=60001-60001msec

Disk stats (read/write):
  sdd: ios=221347/95218, sectors=1770776/761840, merge=0/12, ticks=47402/8221, in_queue=55633, util=89.92%